Hyooki/STM32DUINO_GAMEPAD/variants/pindefinition_examples/Official STM32F407G-DISC1.c

enum {
//*=default , +=alternate
//PIN    |BOARD LABEL                     |I2C1|I2C2|I2C3|SPI1 |SPI2 |SPI3 |USART1|USART2|USART3|USART6|ADC1 |TIM (PWM)                                 |USB       |SDIO|RCC       |SYS        
PA0 , // |B1 [Blue PushButton]            |    |    |    |     |     |     |      |      |      |      |*IN0 |*TIM5_CH1 *TIM2_CH1                       |          |    |          |           
PA1 , // |                                |    |    |    |     |     |     |      |      |      |      |*IN1 |*TIM5_CH2 *TIM2_CH2                       |          |    |          |           
PA2 , // |                                |    |    |    |     |     |     |      |*TX   |      |      |*IN2 |*TIM5_CH3 +TIM9_CH1 *TIM2_CH3             |          |    |          |           
PA3 , // |                                |    |    |    |     |     |     |      |*RX   |      |      |*IN3 |*TIM5_CH4 +TIM9_CH2 *TIM2_CH4             |          |    |          |           
PA4 , // |I2S3_WS [CS43L22_LRCK]          |    |    |    |     |     |     |      |      |      |      |*IN4 |                                          |          |    |          |           
PA5 , // |SPI1_SCK [LIS302DL_SCL/SPC]     |    |    |    |*SCK |     |     |      |      |      |      |*IN5 |*TIM8_CH1N +TIM2_CH1                      |          |    |          |           
PA6 , // |SPI1_MISO [LIS302DL_SDO]        |    |    |    |*MISO|     |     |      |      |      |      |*IN6 |*TIM3_CH1 *TIM13_CH1                      |          |    |          |           
PA7 , // |SPI1_MOSI [LIS302DL_SDA/SDI/SDO]|    |    |    |*MOSI|     |     |      |      |      |      |*IN7 |*TIM1_CH1N +TIM8_CH1N *TIM3_CH2 *TIM14_CH1|          |    |          |           
PA8 , // |                                |    |    |*SCL|     |     |     |      |      |      |      |     |+TIM1_CH1                                 |          |    |          |           
PA9 , // |VBUS_FS                         |    |    |    |     |     |     |*TX   |      |      |      |     |+TIM1_CH2                                 |          |    |          |           
PA10, // |OTG_FS_ID                       |    |    |    |     |     |     |*RX   |      |      |      |     |+TIM1_CH3                                 |          |    |          |           
PA11, // |OTG_FS_DM                       |    |    |    |     |     |     |      |      |      |      |     |+TIM1_CH4                                 |*OTG_FS_DM|    |          |           
PA12, // |OTG_FS_DP                       |    |    |    |     |     |     |      |      |      |      |     |                                          |*OTG_FS_DP|    |          |           
PA13, // |SWDIO                           |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |*JTMS-SWDIO
PA14, // |SWCLK                           |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |*JTCK-SWCLK
PA15, // |                                |    |    |    |     |     |     |      |      |      |      |     |+TIM2_CH1                                 |          |    |          |*JTDI      
PB0 , // |                                |    |    |    |     |     |     |      |      |      |      |*IN8 |*TIM8_CH2N *TIM3_CH3 *TIM1_CH2N           |          |    |          |           
PB1 , // |                                |    |    |    |     |     |     |      |      |      |      |*IN9 |*TIM3_CH4 *TIM1_CH3N *TIM8_CH3N           |          |    |          |           
PB2 , // |BOOT1                           |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PB3 , // |SWO                             |    |    |    |+SCK |     |+SCK |      |      |      |      |     |+TIM2_CH2                                 |          |    |          |*JTDO-SWO  
PB4 , // |                                |    |    |    |+MISO|     |+MISO|      |      |      |      |     |+TIM3_CH1                                 |          |    |          |*JTRST     
PB5 , // |                                |    |    |    |+MOSI|     |+MOSI|      |      |      |      |     |+TIM3_CH2                                 |          |    |          |           
PB6 , // |Audio_SCL [CS43L22_SCL]         |*SCL|    |    |     |     |     |+TX   |      |      |      |     |+TIM4_CH1                                 |          |    |          |           
PB7 , // |                                |*SDA|    |    |     |     |     |+RX   |      |      |      |     |+TIM4_CH2                                 |          |    |          |           
PB8 , // |                                |+SCL|    |    |     |     |     |      |      |      |      |     |*TIM10_CH1 +TIM4_CH3                      |          |*D4 |          |           
PB9 , // |Audio_SDA [CS43L22_SDA]         |+SDA|    |    |     |     |     |      |      |      |      |     |+TIM4_CH4 *TIM11_CH1                      |          |*D5 |          |           
PB10, // |CLK_IN [MP45DT02_CLK]           |    |*SCL|    |     |*SCK |     |      |      |*TX   |      |     |+TIM2_CH3                                 |          |    |          |           
PB11, // |                                |    |*SDA|    |     |     |     |      |      |*RX   |      |     |+TIM2_CH4                                 |          |    |          |           
PB12, // |                                |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PB13, // |                                |    |    |    |     |+SCK |     |      |      |      |      |     |+TIM1_CH1N                                |          |    |          |           
PB14, // |                                |    |    |    |     |+MISO|     |      |      |      |      |     |+TIM8_CH2N +TIM1_CH2N *TIM12_CH1          |*OTG_HS_DM|    |          |           
PB15, // |                                |    |    |    |     |+MOSI|     |      |      |      |      |     |+TIM1_CH3N +TIM8_CH3N *TIM12_CH2          |*OTG_HS_DP|    |          |           
PC0 , // |OTG_FS_PowerSwitchOn            |    |    |    |     |     |     |      |      |      |      |*IN10|                                          |          |    |          |           
PC1 , // |                                |    |    |    |     |     |     |      |      |      |      |*IN11|                                          |          |    |          |           
PC2 , // |                                |    |    |    |     |*MISO|     |      |      |      |      |*IN12|                                          |          |    |          |           
PC3 , // |PDM_OUT [MP45DT02_DOUT]         |    |    |    |     |*MOSI|     |      |      |      |      |*IN13|                                          |          |    |          |           
PC4 , // |                                |    |    |    |     |     |     |      |      |      |      |*IN14|                                          |          |    |          |           
PC5 , // |                                |    |    |    |     |     |     |      |      |      |      |*IN15|                                          |          |    |          |           
PC6 , // |                                |    |    |    |     |     |     |      |      |      |*TX   |     |+TIM3_CH1 *TIM8_CH1                       |          |*D6 |          |           
PC7 , // |I2S3_MCK [CS43L22_MCLK]         |    |    |    |     |     |     |      |      |      |*RX   |     |+TIM3_CH2 *TIM8_CH2                       |          |*D7 |          |           
PC8 , // |                                |    |    |    |     |     |     |      |      |      |      |     |+TIM3_CH3 *TIM8_CH3                       |          |*D0 |          |           
PC9 , // |                                |    |    |*SDA|     |     |     |      |      |      |      |     |+TIM3_CH4 *TIM8_CH4                       |          |*D1 |          |           
PC10, // |I2S3_SCK [CS43L22_SCLK]         |    |    |    |     |     |*SCK |      |      |+TX   |      |     |                                          |          |*D2 |          |           
PC11, // |                                |    |    |    |     |     |*MISO|      |      |+RX   |      |     |                                          |          |*D3 |          |           
PC12, // |I2S3_SD [CS43L22_SDIN]          |    |    |    |     |     |*MOSI|      |      |      |      |     |                                          |          |*CK |          |           
PC13, // |                                |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PC14, // |PC14-OSC32_IN                   |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |*OSC32_IN |           
PC15, // |PC15-OSC32_OUT                  |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |*OSC32_OUT|           
PD0 , // |                                |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD1 , // |                                |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD2 , // |                                |    |    |    |     |     |     |      |      |      |      |     |                                          |          |*CMD|          |           
PD3 , // |                                |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD4 , // |Audio_RST [CS43L22_RESET]       |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD5 , // |OTG_FS_OverCurrent              |    |    |    |     |     |     |      |+TX   |      |      |     |                                          |          |    |          |           
PD6 , // |                                |    |    |    |     |     |     |      |+RX   |      |      |     |                                          |          |    |          |           
PD7 , // |                                |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD8 , // |                                |    |    |    |     |     |     |      |      |+TX   |      |     |                                          |          |    |          |           
PD9 , // |                                |    |    |    |     |     |     |      |      |+RX   |      |     |                                          |          |    |          |           
PD10, // |                                |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD11, // |                                |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD12, // |LD4 [Green Led]                 |    |    |    |     |     |     |      |      |      |      |     |*TIM4_CH1                                 |          |    |          |           
PD13, // |LD3 [Orange Led]                |    |    |    |     |     |     |      |      |      |      |     |*TIM4_CH2                                 |          |    |          |           
PD14, // |LD5 [Red Led]                   |    |    |    |     |     |     |      |      |      |      |     |*TIM4_CH3                                 |          |    |          |           
PD15, // |LD6 [Blue Led]                  |    |    |    |     |     |     |      |      |      |      |     |*TIM4_CH4                                 |          |    |          |           
PE0 , // |                                |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PE1 , // |MEMS_INT2 [LIS302DL_INT2]       |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PE2 , // |                                |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |*TRACECLK  
PE3 , // |CS_I2C/SPI [LIS302DL_CS_I2C/SPI]|    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |*TRACED0   
PE4 , // |                                |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |*TRACED1   
PE5 , // |                                |    |    |    |     |     |     |      |      |      |      |     |*TIM9_CH1                                 |          |    |          |*TRACED2   
PE6 , // |                                |    |    |    |     |     |     |      |      |      |      |     |*TIM9_CH2                                 |          |    |          |*TRACED3   
PE7 , // |                                |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PE8 , // |                                |    |    |    |     |     |     |      |      |      |      |     |+TIM1_CH1N                                |          |    |          |           
PE9 , // |                                |    |    |    |     |     |     |      |      |      |      |     |*TIM1_CH1                                 |          |    |          |           
PE10, // |                                |    |    |    |     |     |     |      |      |      |      |     |+TIM1_CH2N                                |          |    |          |           
PE11, // |                                |    |    |    |     |     |     |      |      |      |      |     |*TIM1_CH2                                 |          |    |          |           
PE12, // |                                |    |    |    |     |     |     |      |      |      |      |     |+TIM1_CH3N                                |          |    |          |           
PE13, // |                                |    |    |    |     |     |     |      |      |      |      |     |*TIM1_CH3                                 |          |    |          |           
PE14, // |                                |    |    |    |     |     |     |      |      |      |      |     |*TIM1_CH4                                 |          |    |          |           
PE15, // |                                |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PH0 , // |PH0-OSC_IN                      |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |*OSC_IN   |           
PH1 , // |PH1-OSC_OUT                     |    |    |    |     |     |     |      |      |      |      |     |                                          |          |    |*OSC_OUT  |           
NB_DIGITAL_PINS,
};

#include "stm32f1xx_hal.h"
#include "spi_com.h"
#include "twi.h"
#include "uart.h"
#include "analog.h"
#include "variant.h"

extern const PinDescription g_APinDescription[]=
{
  { PA0 , GPIO_PIN_0 , GPIOA, GPIO_PIN_IO, false},
  { PA1 , GPIO_PIN_1 , GPIOA, GPIO_PIN_IO, false},
  { PA2 , GPIO_PIN_2 , GPIOA, GPIO_PIN_IO, false},
  { PA3 , GPIO_PIN_3 , GPIOA, GPIO_PIN_IO, false},
  { PA4 , GPIO_PIN_4 , GPIOA, GPIO_PIN_IO, false},
  { PA5 , GPIO_PIN_5 , GPIOA, GPIO_PIN_IO, false},
  { PA6 , GPIO_PIN_6 , GPIOA, GPIO_PIN_IO, false},
  { PA7 , GPIO_PIN_7 , GPIOA, GPIO_PIN_IO, false},
  { PA8 , GPIO_PIN_8 , GPIOA, GPIO_PIN_IO, false},
  { PA9 , GPIO_PIN_9 , GPIOA, GPIO_PIN_IO, false},
  { PA10, GPIO_PIN_10, GPIOA, GPIO_PIN_IO, false},
  { PA11, GPIO_PIN_11, GPIOA, GPIO_PIN_IO, false},
  { PA12, GPIO_PIN_12, GPIOA, GPIO_PIN_IO, false},
  { PA13, GPIO_PIN_13, GPIOA, GPIO_PIN_IO, false},
  { PA14, GPIO_PIN_14, GPIOA, GPIO_PIN_IO, false},
  { PA15, GPIO_PIN_15, GPIOA, GPIO_PIN_IO, false},
  { PB0 , GPIO_PIN_0 , GPIOB, GPIO_PIN_IO, false},
  { PB1 , GPIO_PIN_1 , GPIOB, GPIO_PIN_IO, false},
  { PB2 , GPIO_PIN_2 , GPIOB, GPIO_PIN_IO, false},
  { PB3 , GPIO_PIN_3 , GPIOB, GPIO_PIN_IO, false},
  { PB4 , GPIO_PIN_4 , GPIOB, GPIO_PIN_IO, false},
  { PB5 , GPIO_PIN_5 , GPIOB, GPIO_PIN_IO, false},
  { PB6 , GPIO_PIN_6 , GPIOB, GPIO_PIN_IO, false},
  { PB7 , GPIO_PIN_7 , GPIOB, GPIO_PIN_IO, false},
  { PB8 , GPIO_PIN_8 , GPIOB, GPIO_PIN_IO, false},
  { PB9 , GPIO_PIN_9 , GPIOB, GPIO_PIN_IO, false},
  { PB10, GPIO_PIN_10, GPIOB, GPIO_PIN_IO, false},
  { PB11, GPIO_PIN_11, GPIOB, GPIO_PIN_IO, false},
  { PB12, GPIO_PIN_12, GPIOB, GPIO_PIN_IO, false},
  { PB13, GPIO_PIN_13, GPIOB, GPIO_PIN_IO, false},
  { PB14, GPIO_PIN_14, GPIOB, GPIO_PIN_IO, false},
  { PB15, GPIO_PIN_15, GPIOB, GPIO_PIN_IO, false},
  { PC0 , GPIO_PIN_0 , GPIOC, GPIO_PIN_IO, false},
  { PC1 , GPIO_PIN_1 , GPIOC, GPIO_PIN_IO, false},
  { PC2 , GPIO_PIN_2 , GPIOC, GPIO_PIN_IO, false},
  { PC3 , GPIO_PIN_3 , GPIOC, GPIO_PIN_IO, false},
  { PC4 , GPIO_PIN_4 , GPIOC, GPIO_PIN_IO, false},
  { PC5 , GPIO_PIN_5 , GPIOC, GPIO_PIN_IO, false},
  { PC6 , GPIO_PIN_6 , GPIOC, GPIO_PIN_IO, false},
  { PC7 , GPIO_PIN_7 , GPIOC, GPIO_PIN_IO, false},
  { PC8 , GPIO_PIN_8 , GPIOC, GPIO_PIN_IO, false},
  { PC9 , GPIO_PIN_9 , GPIOC, GPIO_PIN_IO, false},
  { PC10, GPIO_PIN_10, GPIOC, GPIO_PIN_IO, false},
  { PC11, GPIO_PIN_11, GPIOC, GPIO_PIN_IO, false},
  { PC12, GPIO_PIN_12, GPIOC, GPIO_PIN_IO, false},
  { PC13, GPIO_PIN_13, GPIOC, GPIO_PIN_IO, false},
  { PC14, GPIO_PIN_14, GPIOC, GPIO_PIN_IO, false},
  { PC15, GPIO_PIN_15, GPIOC, GPIO_PIN_IO, false},
  { PD0 , GPIO_PIN_0 , GPIOD, GPIO_PIN_IO, false},
  { PD1 , GPIO_PIN_1 , GPIOD, GPIO_PIN_IO, false},
  { PD2 , GPIO_PIN_2 , GPIOD, GPIO_PIN_IO, false},
  { PD3 , GPIO_PIN_3 , GPIOD, GPIO_PIN_IO, false},
  { PD4 , GPIO_PIN_4 , GPIOD, GPIO_PIN_IO, false},
  { PD5 , GPIO_PIN_5 , GPIOD, GPIO_PIN_IO, false},
  { PD6 , GPIO_PIN_6 , GPIOD, GPIO_PIN_IO, false},
  { PD7 , GPIO_PIN_7 , GPIOD, GPIO_PIN_IO, false},
  { PD8 , GPIO_PIN_8 , GPIOD, GPIO_PIN_IO, false},
  { PD9 , GPIO_PIN_9 , GPIOD, GPIO_PIN_IO, false},
  { PD10, GPIO_PIN_10, GPIOD, GPIO_PIN_IO, false},
  { PD11, GPIO_PIN_11, GPIOD, GPIO_PIN_IO, false},
  { PD12, GPIO_PIN_12, GPIOD, GPIO_PIN_IO, false},
  { PD13, GPIO_PIN_13, GPIOD, GPIO_PIN_IO, false},
  { PD14, GPIO_PIN_14, GPIOD, GPIO_PIN_IO, false},
  { PD15, GPIO_PIN_15, GPIOD, GPIO_PIN_IO, false},
  { PE0 , GPIO_PIN_0 , GPIOE, GPIO_PIN_IO, false},
  { PE1 , GPIO_PIN_1 , GPIOE, GPIO_PIN_IO, false},
  { PE2 , GPIO_PIN_2 , GPIOE, GPIO_PIN_IO, false},
  { PE3 , GPIO_PIN_3 , GPIOE, GPIO_PIN_IO, false},
  { PE4 , GPIO_PIN_4 , GPIOE, GPIO_PIN_IO, false},
  { PE5 , GPIO_PIN_5 , GPIOE, GPIO_PIN_IO, false},
  { PE6 , GPIO_PIN_6 , GPIOE, GPIO_PIN_IO, false},
  { PE7 , GPIO_PIN_7 , GPIOE, GPIO_PIN_IO, false},
  { PE8 , GPIO_PIN_8 , GPIOE, GPIO_PIN_IO, false},
  { PE9 , GPIO_PIN_9 , GPIOE, GPIO_PIN_IO, false},
  { PE10, GPIO_PIN_10, GPIOE, GPIO_PIN_IO, false},
  { PE11, GPIO_PIN_11, GPIOE, GPIO_PIN_IO, false},
  { PE12, GPIO_PIN_12, GPIOE, GPIO_PIN_IO, false},
  { PE13, GPIO_PIN_13, GPIOE, GPIO_PIN_IO, false},
  { PE14, GPIO_PIN_14, GPIOE, GPIO_PIN_IO, false},
  { PE15, GPIO_PIN_15, GPIOE, GPIO_PIN_IO, false},
  { PH0 , GPIO_PIN_0 , GPIOH, GPIO_PIN_IO, false},
  { PH1 , GPIO_PIN_1 , GPIOH, GPIO_PIN_IO, false},
};



spi_init_info_t spi_init_info[] = { 
  { 
    .init_done = 0, 
    .spi_instance = SPI1, 
    .mosi_alternate = GPIO_AF5_SPI1,
    .mosi_port = GPIOA, 
    .mosi_pin =  GPIO_PIN_7, 
    .miso_alternate = GPIO_AF5_SPI1,
    .miso_port = GPIOA, 
    .miso_pin = GPIO_PIN_6, 
    .sck_alternate = GPIO_AF5_SPI1,
    .sck_port = GPIOA, 
    .sck_pin = GPIO_PIN_5, 
  },
  { 
    .init_done = 0, 
    .spi_instance = SPI2, 
    .mosi_alternate = GPIO_AF5_SPI2,
    .mosi_port = GPIOC, 
    .mosi_pin =  GPIO_PIN_3, 
    .miso_alternate = GPIO_AF5_SPI2,
    .miso_port = GPIOC, 
    .miso_pin = GPIO_PIN_2, 
    .sck_alternate = GPIO_AF5_SPI2,
    .sck_port = GPIOB, 
    .sck_pin = GPIO_PIN_10, 
  },
  { 
    .init_done = 0, 
    .spi_instance = SPI3, 
    .mosi_alternate = GPIO_AF6_SPI3,
    .mosi_port = GPIOC, 
    .mosi_pin =  GPIO_PIN_12, 
    .miso_alternate = GPIO_AF6_SPI3,
    .miso_port = GPIOC, 
    .miso_pin = GPIO_PIN_11, 
    .sck_alternate = GPIO_AF6_SPI3,
    .sck_port = GPIOC, 
    .sck_pin = GPIO_PIN_10, 
  },
}; 

uint8_t NB_SPI_INSTANCES = sizeof(spi_init_info) / sizeof(spi_init_info[0]);

i2c_init_info_t g_i2c_init_info[] = {
  {
    .init_done = 0,
    .i2c_instance = I2C1,
    .irq = I2C1_EV_IRQn,
    .sda_alternate = GPIO_AF4_I2C1,
    .sda_port = GPIOB,
    .sda_pin = GPIO_PIN_7,
    .scl_alternate = GPIO_AF4_I2C1,
    .scl_port = GPIOB,
    .scl_pin = GPIO_PIN_6,
    .i2c_onSlaveReceive = NULL,
    .i2c_onSlaveTransmit = NULL,
    .i2cTxRxBufferSize = 0
  },
  {
    .init_done = 0,
    .i2c_instance = I2C2,
    .irq = I2C2_EV_IRQn,
    .sda_alternate = GPIO_AF4_I2C2,
    .sda_port = GPIOB,
    .sda_pin = GPIO_PIN_11,
    .scl_alternate = GPIO_AF4_I2C2,
    .scl_port = GPIOB,
    .scl_pin = GPIO_PIN_10,
    .i2c_onSlaveReceive = NULL,
    .i2c_onSlaveTransmit = NULL,
    .i2cTxRxBufferSize = 0
  },
  {
    .init_done = 0,
    .i2c_instance = I2C3,
    .irq = I2C3_EV_IRQn,
    .sda_alternate = GPIO_AF4_I2C3,
    .sda_port = GPIOC,
    .sda_pin = GPIO_PIN_9,
    .scl_alternate = GPIO_AF4_I2C3,
    .scl_port = GPIOA,
    .scl_pin = GPIO_PIN_8,
    .i2c_onSlaveReceive = NULL,
    .i2c_onSlaveTransmit = NULL,
    .i2cTxRxBufferSize = 0
  },
};

uint8_t NB_I2C_INSTANCES = sizeof(g_i2c_init_info) / sizeof(g_i2c_init_info[0]);


